app/controllers/api/v1/perfumes_controller.rb

SELECT "perfumes".* FROM "perfumes"
---
  def index
    @perfumes = Perfume.all

SELECT  "perfumes".* FROM "perfumes" WHERE "perfumes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @perfume = Perfume.find(params[:id])