app/controllers/api/v1/reviews_controller.rb

INSERT INTO "reviews" ("name", "rating", "review_text", "created_at", "updated_at", "perfume_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "chicken burger"], ["rating", 0], ["review_text", ""], ["created_at", "2019-02-12 01:21:54.403441"], ["updated_at", "2019-02-12 01:21:54.403441"], ["perfume_id", 10]]
---
  def create
    # byebug
    @review = Review.new(name: params[:name], rating: params[:rating], review_text: params[:review_text], perfume_id: params[:id])

    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = $1, "review_text" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["rating", 3], ["review_text", "eh"], ["updated_at", "2019-04-26 21:52:07.984401"], ["id", 2]]
---
def update
  @review = Review.find(params[:r_id])
  @review.update(name: params[:name], rating: params[:rating], review_text: params[:review_text], perfume_id: params[:p_id])